Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.
import pandas as pd

data = [4, 8, 15, 16, 23, 42]
series = pd.Series(data)

In [1]:
import pandas as pd

In [2]:
data=[4,8,15,16,23,42]

In [3]:
data

[4, 8, 15, 16, 23, 42]

In [4]:
se=pd.Series(data)

In [5]:
se

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
my_series = pd.Series(my_list)

In [6]:



my_list = [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
my_series = pd.Series(my_list)

In [7]:
my_series

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

In [8]:
data2={"name":['alice','bob','claire'],
      "age":[25,30,27],
      "gendar":['female','male','female']}

In [9]:
data2

{'name': ['alice', 'bob', 'claire'],
 'age': [25, 30, 27],
 'gendar': ['female', 'male', 'female']}

In [10]:
df=pd.DataFrame(data2)

In [11]:
df

     name  age  gendar
0   alice   25  female
1     bob   30    male
2  claire   27  female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.
in pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different types. It can be thought of as a table in a relational database or an Excel spreadsheet. Each column in a DataFrame is a pandas Series. The main difference between a DataFrame and a Series is that a DataFrame can store and handle data in multiple dimensions, while a Series is a one-dimensional array.

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

Some common functions for data manipulation in a Pandas DataFrame include merge(), groupby(), pivot_table(), apply(), and concat(). For instance, the groupby() function is handy for grouping data based on specific criteria, allowing for aggregation operations like sum, mean, or count. This function is beneficial when analyzing sales data to calculate total revenue per region or average sales per product category. By grouping the data using groupby(), you can efficiently derive meaningful insights from your dataset.

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?
In pandas, Series and DataFrame are mutable, meaning their values can be changed after creation. However, Panel is considered immutable, which implies that its values cannot be altered once it is created. Therefore, Series and DataFrame allow modifications to their data, while Panel does not support such changes.

Q7. Create a DataFrame using multiple Series. Explain with an example.
import pandas as pd


series1 = pd.Series([10, 20, 30, 40], name='A')
series2 = pd.Series(['apple', 'banana', 'cherry', 'date'], name='B')


df = pd.DataFrame({series1.name: series1, series2.name: series2})

In [19]:


series1 = pd.Series([10, 20, 30, 40], name='A')
series2 = pd.Series(['apple', 'banana', 'cherry', 'agur'], name='B')

df = pd.DataFrame({series1.name: series1, series2.name: series2})

In [20]:
df

    A       B
0  10   apple
1  20  banana
2  30  cherry
3  40    agur